// Задание 1
// Создать переменные num1, num2 которые пользователь вводит с клавиатуры
// Проверьте, что переменная num1 равна или меньше 1, а переменная num2 больше или равна 3.
let num1 = prompt('Введите число num1');
let num2 = prompt('Введите число num2');
if (num1 <= 1) {
    console.log('Все верно, num1 меньше или равна 1');
} else {
    alert('num1 введена не верно');
}
if (num2 >= 3) {
    console.log('Все верно, num2 больше или равна 3');
} else {
    alert('num2 введена не верно');
}
// (num1 <= 1) ? console.log('Все верно, num1 меньше или равна 1') : alert('num1 введена не верно');
// (num2 >= 3) ?  console.log('Все верно, num2 больше или равна 3') : alert('num2 введена не верно');

// Задание 2
// Перепишите код к тернарному оператору
// let test = true;
// if (test === true) {
// console.log('+++');
// } else {
// console.log('---');
// }
let test = true;
(test === true) ? console.log('+++') : console.log('---');

// Задание 3
// В переменной day лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
let day = prompt('Введите число от 1 до 31');
if (day > 31 || day < 1) {
    alert('Число введено не верно');
} else {
    if (day >= 0 && day <= 10) {
        alert('Первая декада');
    } else if (day > 10 && day <= 20) {
        alert('Вторая декада');
    } else if (day > 20 && day <= 31) {
        alert('Третья декада');
    }
}