// Задание 1 
// Создайте функцию которая возводит переданное число в куб, необходимо вывести в консоль результат 2^3 степени + 3 ^ 3 степени
function doCube(number) {
    return number*number*number;
}
console.log(doCube(2)+doCube(3));

// Задание 2
// Пользователь вводит с клавиатуры число, если ввёл текст, необходимо вывести что значение задано неверно
// Создать фукнцию, которая высчитывает 13% от данного числа и выводит в консоль текст "Размер заработной платы за вычетом налогов равен значение"

const num = parseInt(prompt("Сколько ты зарабатываешь?"));
if (isNaN(num)) {
    console.log("Вы ввели текст! Значение задано не верно");
} else {
    console.log(`Размер зароботной платы за вычетом налогов = ${myTaxes(num)}`);
}

function myTaxes(selary) {
    return selary*0.87;
}

// Задание 3
// Пользователь с клавиатуры вводит 3 числа, необходимо создать функцию, которая определяет максимальное значение среди этих чисел

const a = +prompt("Введите число a");
const b = +prompt("Введите число b");
const c = +prompt("Введите число c");

function maxNumber(num1,num2,num3) {
    let max = 0;
    if (num1 > num2) max = num1;
    else max = num2;
    if (num3 > max) max = num3;
    return max;
}
console.log(`Максимальное число из всех = ${maxNumber(a,b,c)}`);

// Задание 4
// Необходимо реализовать четыре функции, каждая функция должна принимать по два числа и выполнять одну из операций (каждая функция выполняет одну из них):
// 1. Сложение
// 2. Разность
// 3. Умножение
// 4. Деление
// Необходимо сделать так, чтобы функция вернула число, например выражение console.log(sum(2, 6)); должно вывести число 8 в консоль (sum - функция сложения в данном примере, ваши названия функций могут отличаться). Округлять значения, которые возвращают функции не нужно, однако, обратите внимание на разность, функция должна вычесть из большего числа меньшее, либо вернуть 0, если числа равны. Функциям всегда передаются корректные числа, проверки на NaN, Infinity делать не нужно.

const number1 = +prompt("Введите первое число");
const number2 = +prompt("Введите второе число");

function addition(num1, num2) {
    return num1 + num2;
}
function subtraction(num1, num2) {
    return num1 - num2;
}
function multiplication(num1, num2) {
    return num1 * num2;
}
function division(num1, num2) {
    return num1 / num2;
}
console.log(`Результат сложения = ${addition(number1, number2)}`);
console.log(`Результат вычетания = ${subtraction(number1, number2)}`);
console.log(`Результат умножения = ${multiplication(number1, number2)}`);
console.log(`Результат деления = ${division(number1, number2)}`);